feat: updated documentation
